//
//  Results.swift
//  CheckHealth
//
//  Created by Ilya Bolotov on 14.12.2020.
//

import Foundation


func resultIPSS(for value: Double) -> String {
    switch value {
    case 0:
        return "Вы здоровы!"
    case 1...7:
        return "Нарушение мочеиспускания легкой степени"
    case 8...19:
        return "Нарушение мочеиспускания умеренной степени"
    case 20...:
        return "Нарушение мочеиспускания тяжелой степени"
    default:
        return "Ошибка"
    }
}

func resultMIEF5(for value: Double) -> String {
    switch value {
    case 5...7:
        return "Все отлично. Проблем с эрекцией нет! \n"
    case 8...11:
        return "Легкая степень нарушения эректильной функции. \n\nВозможно, стоит обратиться к врачу урологу-андрологу \n"
    case 12...16:
        return "Умеренно-легкая степень нарушения эректильной функции. \n\nОбратитесь к врачу урологу-андрологу \n"
    case 17...21:
        return "Умеренная степень нарушения эректильной функции. \n\nОбратитесь к врачу урологу-андрологу \n"
    case 22...25:
        return "Тяжелая степень нарушения эректильной функции. \n\nОбратитесь к врачу урологу-андрологу \n"
    default:
        return "Ошибка"
    }
}

func resultCAGE(for value: Double) -> String {
    switch value {
    case 0:
        return "Алкогольной зависимости нет!"
    case 1:
        return "Имеется риск возникновения алкогольной зависимости"
    case 2...3:
        return "Средняя вероятность наличия алкогольной зависимости"
    case 4:
        return "Высокая вероятность наличия алкогольной зависимости"
    default:
        return "Ошибка"
    }
}

func resultFagerstrem(for value: Double) -> String {
    switch value {
    case 0...2:
        return "Очень слабая никотиновая зависимость"
    case 3...4:
        return "Cлабая никотиновая зависимость"
    case 5:
        return "Средняя никотиновая зависимость"
    case 6...7:
        return "Высокая никотиновая зависимость"
    case 8...:
        return "Очень высокая никотиновая зависимость"
    default:
        return "Ошибка"
    }
}

func calcFSFI(answer: Int, question: Int) -> Double {
    switch answer {
    case 1, 2:
        return Double(question) * 0.6
    case 3...10:
        return Double(question) * 0.3
    case 11...19:
        return Double(question) * 0.4
    default:
        return 0.0
    }
}

func resultFSFI(for value: Double) -> String {
    switch value {
    case ...14.4:
        return "Выраженная степень возможной сексуальной дисфункции"
    case 14.5...21.6:
        return "Умеренная степень возможной сексуальной дисфункции"
    case 21.7...28.8:
        return "Низкая степень возможной сексуальной дисфункции"
    case 28.9...:
        return "Cостояние сексуального комфорта"
    default:
        return "Ошибка"
    }
}

func resultHeartRisk(for value: Double) -> String {
    switch value {
    case 0...4:
        return "Риск сердечно-сосудистых заболеваний: Отсутствует. \n\nПродолжайте здоровый образ жизни и привлекайте к нему своих друзей и близких."
    case 5...16:
        return "Риск сердечно-сосудистых заболеваний: Минимальный. \n\nПриложите усилия к коррекции факторов риска развития сердечно-сосудистых заболеваний."
    case 17...29:
        return "Риск сердечно-сосудистых заболеваний: Явный. \n\nУделяйте больше времени и внимания своему здоровью, лечитесь регулярно."
    case 30...42:
        return "Риск сердечно-сосудистых заболеваний: Выраженный. \n\nПрикладывайте больше усилий к оздоровлению, профилактике и эффективному лечению."
    case 43...:
        return "Риск сердечно-сосудистых заболеваний: Максимальный. \n\nВам необходима срочная консультация кардиолога"
    default:
        return "Ошибка"
    }
}

func resultHobl(for value: Double) -> String {
    switch value {
    case 0:
        return "Вы здоровы!"
    case 1...11.0:
        return "Вероятно у вас нет хронической болезни легких. Но если вас беспокоят перечисленные в тесте симптомы, рассмотрите другие заболевания и обратитесь к врачу"
    case 12.0...:
        return "Диагноз хронической болезни легких вероятен. \n\nВам необходима консультация врача"
    default:
        return "Ошибка"
    }
}

func resultVien(for value: Double) -> String {
    switch value {
    case ...14.9:
        return "Ваши вены – в хорошем состоянии. Постарайтесь и дальше заботиться о здоровье своих ног"
    case 15.0...64.9:
        return "Имеется небольшая предрасположенность к развитию варикоза"
    case 65.0...104.9:
        return "У вас имеются предпосылки для развития варикозной болезни. \n\nВозможно, вам стоит обратиться к врачу флебологу."
    case 105.0...:
        return "Высокая вероятность наличия варикозной болезни. \n\nОбратитесь к врачу флебологу"
    default:
        return "Ошибка"
    }
}

func resultSon(for value: Double) -> String {
    switch value {
    case ...18.0:
        return "Высока вероятность наличия бессоницы. \n\nВозможно, вам стоит обратиться к врачу"
    case 19.0...21.0:
        return "Пограничный результат. Возможно, у вас бессоница. \n\nДля уточнения обратитесь к врачу"
    case 22.0...:
        return "Все отлично! \n\nБессоницы у вас нет"
    default:
        return "Ошибка"
    }
}

func resultMemory(for value: Double) -> String {
    switch value {
    case ...35.0:
        return "Все отлично! \n\nПроблем с памятью у вас нет"
    case 36.0...41.0:
        return "Пограничный результат. \n\nВозможно, вам стоит больше отдыхать?"
    case 42.0...:
        return "Вероятно наличие когнитивных нарушений. \n\nВозможно, вам стоит обратиться к врачу-неврологу."
    default:
        return "Ошибка"
    }
}

func resultProlaps(for value: Double) -> String {
    switch value {
    case ...4.0:
        return "Все отлично! \n\nУ вас нет пролапса"
    case 5.0...:
        return "Возможно у вас наличие пролапса (опущение органов). \n\nОбратитесь к гинекологу"
    default:
        return "Ошибка"
    }
}

func resultDepression(for value: Double) -> String {
    switch value {
    case 0...9.0:
        return "Отсутствуют депрессивные симптомы"
    case 10.0...15.0:
        return "Легкая депрессия (субдепрессия)"
    case 16.0...19.0:
        return "Умеренная депрессия"
    case 20.0...29:
        return "Выраженная депрессия (средней тяжести). \n\nВозможно, стоит обратиться к психологу"
    case 30.0...:
        return "Тяжелая депрессия. \n\nОбратитесь к психотерапевту"
    default:
        return "Ошибка"
    }
}

func resultStroke(for value: Double) -> String {
    switch value {
    case ...99.0:
        return "Все отлично! \n\nПродолжайте поддерживать здоровый образ жизни!"
    case 100...150.0:
        return "Подумайте об изменении образа жизни и режима питания"
    case 151.0...300.0:
        return "Вам не следует пренебрегать обследованием и лечением"
    case 301.0...:
        return "Вы в группе высокого риска. \n\nВам необходимо углубленное обследование и разработка индивидуальных мер предупреждения острых заболеваний сердечно-сосудистой системы"
    default:
        return "Ошибка"
    }
}

func resultAMS(for value: Double) -> String {
    switch value {
    case 17.0...26.0:
        return "Возрастные симптомы не выражены. У Вас не наблюдается признаков дефицита тестостерона. \n\nДанный тест позволяет только заподозрить дефицит тестостерона и может использоваться самостоятельно лишь на этапе до визита к врачу. Если у Вас есть какие-либо жалобы, обратитесь для очного осмотра к специалисту (урологу-андрологу)."
    case 27.0...36.0:
        return "Слабовыраженные признаки дефицита тестостерона. \n\nДанный тест позволяет только заподозрить дефицит тестостерона и может использоваться самостоятельно лишь на этапе до визита к врачу. Если у Вас есть какие-либо жалобы, обратитесь для очного осмотра к специалисту (урологу-андрологу)."
    case 37.0...49.0:
        return "Признаки дефицита тестостерона средней степени выраженности. \n\nДанный тест позволяет только заподозрить дефицит тестостерона и может использоваться самостоятельно лишь на этапе до визита к врачу. Если у Вас есть какие-либо жалобы, обратитесь для очного осмотра к специалисту (урологу-андрологу)."
    case 50.0...:
        return "Резко выраженные признаки дефицита тестостерона. \n\nДанный тест позволяет только заподозрить дефицит тестостерона и может использоваться самостоятельно лишь на этапе до визита к врачу. Если у Вас есть какие-либо жалобы, обратитесь для очного осмотра к специалисту (урологу-андрологу)."
    default:
        return "Ошибка"
    }
}

func resultClimax(for value: Double) -> String {
    switch value {
    case ...10.0:
        return "Слабо выраженный климактерический синдром"
    case 10.0...20.0:
        return "Умеренный климактерический синдром"
    case 20.0...:
        return "Выраженный климактерический синдром"
    default:
        return "Ошибка"
    }
}

